{"version": 2, "text": "The Terms and Conditions below are effective for all users\nLast Updated on July 18, 2019\n\nComma.ai, Inc. Terms and Conditions\n\nPlease read these Terms and Conditions (\"Terms\", \"Terms and Conditions\") carefully before using openpilot (the \"Software\"), a software offered by Comma.ai, Inc., a corporation organized under the laws of Delaware (“comma”, \"us\", \"we\", or \"our\").\nYour use of the Software is conditioned on your acceptance of and compliance with these Terms. These Terms apply to all users and others who access or use the Software.\nBy accessing or using the Software you agree to be bound by these Terms. If you disagree with any part of the terms then you may not access the Software.\n\nAccounts\nTo be able to use our mobile application, you must create an account with us. By creating an account, you guarantee that you are above the age of 18, and that the information you provide us is accurate, complete, and current at all times.\nInaccurate, incomplete, or obsolete information may result in the immediate termination of your account on the Software.\n\nCommunications\n\nYou agree that comma may contact you by email in connection with our Software. You also understand that you may opt out of receiving email messages at any time by contacting us at the email address below. If you do not choose to opt out, comma may contact you as outlined in its User Privacy Policy.\n\nAvailability, Errors and Inaccuracies\nWe are constantly updating offerings on the Software. The Software may contain errors. Products or services may be described inaccurately, or unavailable on the Software.\nWe therefore reserve the right to change or update information and to correct errors, inaccuracies, or omissions at any time without prior notice.\n\nIndemnification\n\nTo the maximum extent allowable by law, you agree to defend, indemnify and hold harmless comma, and its employees, partners, suppliers, contractors, investors, agents, officers, directors, and affiliates, from and against any and all claims, damages, causes of action, penalties, interest, demands, obligations, losses, liabilities, costs or debt, additional taxes, and expenses (including but not limited to attorneys’ fees), resulting from or arising out of (i) your use and access of, or inability to use or access, the Software, (ii) your breach of these Terms, (iii) the inaccuracy of any information, representation or warranty made by you, (iv) activities of anyone other than you in connection with the Software through your comma account, (v) any other of your activities under or in connection with these Terms.\n\nLimitation of Liability\nIn no event shall comma, nor its directors, employees, partners, agents, suppliers, or affiliates, be liable for any indirect, incidental, special, consequential or punitive damages, including without limitation, loss of profits, data, use, goodwill, or other intangible losses, resulting from (i) your access to or use of or inability to access or use of the Software; or (ii) any conduct or content of any third party on the Software whether based on warranty, contract, tort (including negligence) or any other legal theory, whether or not we have been informed of the possibility of such damage, and even if a remedy set forth herein is found to have failed of its essential purpose.\n\nDisclaimer\nYour use of the Software is at your sole risk. The Software is provided on an \"AS IS\" and \"AS AVAILABLE\" basis. The Software is provided without warranties of any kind, whether express or implied, including, but not limited to, implied warranties of merchantability, fitness for a particular purpose, non-infringement or course of performance.\nWe undertake reasonable measures to preserve and secure information collected through our Service.  However, no data collection, transmission or storage system is 100% secure, and there is always a risk that your information may be intercepted without our consent.  In using the Software, you acknowledge that comma is not responsible for intercepted information, and you hereby release us from any and all claims arising out of or related to the use of intercepted information in any unauthorized manner.\n\ncomma prime\ncomma prime (“Service”) is a subscription service offered by comma and supported by a wireless service carrier (“Network”).\n\nYou have no contractual relationship with, and are not a third-party beneficiary of any agreement between comma and the wireless service carrier. You agree that the wireless service carrier or comma will have no legal, equitable or other liability of any kind to you.\n\nSubject to FCC Number portability rules, you have no property or other rights in any assigned Number and such Number can be changed at any time.\n\nYou understand Service may be temporarily refused, interrupted, curtailed or limited because of atmospheric, terrain, or other natural or artificial conditions and may be temporarily interrupted or curtailed due to usage concentrations, modifications, upgrades, relocation and repairs of transmission Network. You agree that the wireless service carrier or comma will not be responsible for such interruptions of the Service or the inability to use the Service within or outside the Authorized Areas.\n\nYou understand that the wireless service carrier or comma cannot guarantee the security of wireless transmissions and will not be liable for any lack of security relating to the use of the Service.\n\nYou understand and agree that the liability and obligations of comma to you under the this agreement may be strictly controlled and limited by the wireless service carrier’s tariff, if any, and the laws, rules and regulations of the FCC and other United States or foreign governmental authorities which from time to time have jurisdiction. In any event, regardless of the form of action, whether for breach of contract, warranty, negligence, strict liability in tort or otherwise, your exclusive remedy and the total liability of the wireless service carrier, comma, and/or any supplier of services to comma arising in any way in connection with this agreement, for any cause whatsoever, including, but not limited to, any failure or disruption of Service provided, will be limited to payment by comma of damages in an amount equal to the amount charged to you for the Service provided under this agreement. In no event will comma and/or the wireless service carrier be liable for any cost, delay, failure or disruption of the Service, lost profits, or incidental, special, punitive or consequential damages.\n\ncomma and/or the wireless service carrier will not be liable for the failure or incompatibility of your Equipment in connection with the Service. You will use Equipment at its own risk.\n\nYou will indemnify, defend and hold comma, the wireless service carrier and the officers, employees and agents of each of them harmless from and against all claims, causes of action, losses, expenses, liability or damages (including reasonable attorneys’ fees and costs), and including without limitation for any personal injury or death, arising in any way directly or indirectly in connection with the this agreement; the provision or use of the Service; or the use, failure to use or inability to use the Number. This provision will survive the termination of this agreement.\n\nYou acknowledge that this agreement is assignable by comma.\nService may be temporarily suspended or permanently terminated without notice if comma’s agreement with the wireless service carrier is terminated for any reason, or the you violate the Network rules and policies. You waive any and all claims against the underlying wireless service carrier, including any roaming carrier, for such suspension or termination.\n\nYou may not engage in any of the following actions:\n• Use the Service for Machine to Machine based remote monitoring to provide life-sustaining medical care for any individual, including without limitation, in health care and assisted living environments;\n• Use the Service for the sale of any type of calling card product or service, including, but not limited to, any ‘grab-and-go’ or rechargeable product with a pin code that allows the you to purchase and/or refill minutes, internet access Service features or service;\n• Use, or attempt to use, the Service for voice communications on a white label SIM card, or in any manner that creates, or appears to create a new “brand” of wireless service;\n• Use the Service for monitoring third parties without their permission, including, but not limited to, prisoner and parolee monitoring;\n• Use Equipment that utilizes a comma SIM to make voice calls over a Wi-Fi network, including, without limitation, the use of any existing add-on feature that allows Wi-Fi calling capability;\n• Modify the Service in any manner, including, but not limited to, combining to include any Provider or third-party products, services, features or functionalities that are not included in the Service standing alone (“Bundled Service”) without prior written approval from the Network Vice President; Resell the Service or Equipment to any government End User or subscriber, including, but not limited to federal, state, and local governmental entities; and\n• Resell the Service or Equipment by promoting any Network specific feature that may be included with the Network rate plan other than base voice or internet access Service usage allotments that are provided for domestic use with each rate plan. By way of example only, Provider is prohibited from promoting or marketing any Network rate plan feature that include discounted international roaming (a/k/a Simple GlobalTM); unlimited music streaming (a/k/a Music FreedomTM), or any future features or benefits that are exclusively marketed by Network with its rate plans.\n\nExclusions\nSome jurisdictions do not allow the exclusion of certain warranties or the exclusion or limitation of liability for consequential or incidental damages, so the limitations above may not apply to you.\n\nChanges\nWe reserve the right, at our sole discretion, to modify or replace these Terms at any time. If a revision is material we will provide at least 15 days’ notice prior to any new terms taking effect. What constitutes a material change will be determined at our sole discretion.\nBy continuing to access or use our Software after any revisions become effective, you agree to be bound by the revised terms. If you do not agree to the new terms, you are no longer authorized to use the Software.\n\nContact Us\nIf you have any questions about these Terms, please contact us at support@comma.ai.\n"}
